Autodesk.Revit.DB.Architecture.StairsComponentConnection.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.StairsComponentConnection.PeerConnectionType
The connection type of the peer connected stairs component.
Since:
2014

Autodesk.Revit.DB.Architecture.StairsComponentConnection.ConnectionType
The connection type of the connected stairs component.
Since:
2014

Autodesk.Revit.DB.Architecture.StairsComponentConnection.PeerElementId
The element Id of peer connected stairs component in the stairs connection.
Since:
2014

Autodesk.Revit.DB.Architecture.StairsComponentConnection.ElementId
The element Id of connected stairs component in the stairs connection.
Since:
2014

Autodesk.Revit.DB.Architecture.StairsComponentConnection
Represents information about a connection among stairs components(run to landing).
Since:
2014